examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_006/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          12;
        startFace       38104;
    }
    inlet_1
    {
        type            patch;
        nFaces          12;
        startFace       38116;
    }
    inlet_2
    {
        type            patch;
        nFaces          12;
        startFace       38128;
    }
    inlet_3
    {
        type            patch;
        nFaces          12;
        startFace       38140;
    }
    inlet_4
    {
        type            patch;
        nFaces          12;
        startFace       38152;
    }
    inlet_5
    {
        type            patch;
        nFaces          12;
        startFace       38164;
    }
    inlet_6
    {
        type            patch;
        nFaces          12;
        startFace       38176;
    }
    inlet_7
    {
        type            patch;
        nFaces          12;
        startFace       38188;
    }
    outlet
    {
        type            patch;
        nFaces          96;
        startFace       38200;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       38296;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       38296;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38400;
        startFace       38696;
    }
)

// ************************************************************************* //
